cards/website.org
#+TITLE: Website

* Website [3/3]
   + [X] Learn html and css (udacity).
   + [X] middleman (ruby) for static page generation. [3/3]

     + [X] HAML, partial and filters.
     + [X] Bootrstrap inteegration
     + [X] Use the following to deploy interactively with live-reload.
       #+BEGIN_SRC sh
         bundle exec middleman
       #+END_SRC

   + [X] Write about codemirror and mathjax in codemirror

* Recreate online cv with middleman and org for blog
    + [X] Online cv done.
    + [ ] Understand middleman gh-page for blog.
    + [ ] Links org files.
    + [ ] Publish summaries.


** See also (generated)

- 

