docs-md/cards/website.md
- [Website <code>[3/3]</code>](#orgca2e027)
- [Recreate online cv with middleman and org for blog](#org8df6d3c)
  - [See also (generated)](#org5582868)



<a id="orgca2e027"></a>

# Website <code>[3/3]</code>

-   [X] Learn html and css (udacity).
-   [X] middleman (ruby) for static page generation. <code>[3/3]</code>
    -   [X] HAML, partial and filters.
    -   [X] Bootrstrap inteegration
    -   [X] Use the following to deploy interactively with live-reload.
        
        ```sh
        bundle exec middleman
        ```

-   [X] Write about codemirror and mathjax in codemirror


<a id="org8df6d3c"></a>

# Recreate online cv with middleman and org for blog

-   [X] Online cv done.
-   [ ] Understand middleman gh-page for blog.
-   [ ] Links org files.
-   [ ] Publish summaries.


<a id="org5582868"></a>

## See also (generated)

-
